/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#include "STC8G_H_Timer.h"

#include "bsp_led.h"
#include "bsp_buzzer.h"

//========================================================================
// 函数: Timer0_ISR_Handler
// 描述: Timer0中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
// void Timer0_ISR_Handler(void) interrupt TMR0_VECTOR // 进中断时已经清除标志
// {
// 在bsp_timer.c中已经定义了定时器0的中断处理函数
// }

//========================================================================
// 函数: Timer1_ISR_Handler
// 描述: Timer1中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
// void Timer1_ISR_Handler(void) interrupt TMR1_VECTOR // 进中断时已经清除标志
// {
// 	//在bsp_timer.c中已经定义了定时器1的中断处理函数
// }

//========================================================================
// 函数: Timer2_ISR_Handler
// 描述: Timer2中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer2_ISR_Handler(void) interrupt TMR2_VECTOR // 进中断时已经清除标志
{
	// 蜂鸣器方波发生：翻转蜂鸣器引脚（非阻塞播放使用）
	Buzzer_ToneIsr();
}

//========================================================================
// 函数: Timer3_ISR_Handler
// 描述: Timer3中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer3_ISR_Handler(void) interrupt TMR3_VECTOR // 进中断时已经清除标志
{
	// 	//在bsp_timer.c中已经定义了定时器3的中断处理函数
}

//========================================================================
// 函数: Timer4_ISR_Handler
// 描述: Timer4中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer4_ISR_Handler(void) interrupt TMR4_VECTOR // 进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
	P63 = ~P63;
}
